/*
 * DNP3.h
 *
 *  Created on: Nov 13, 2021
 *      Author: mhn
 */
#include <iostream>




#ifndef DNP3_H_
#define DNP3_H_


/* This type MUST be 8 bit */
typedef unsigned char	BYTE;

/* These types MUST be 16 bit */
typedef short			SHORT;
typedef unsigned short	WORD;
typedef unsigned short	WCHAR;

/* These types MUST be 16 bit or 32 bit */
typedef int				INT;
typedef unsigned int	UINT;

/* These types MUST be 32 bit */
typedef long			LONG;
typedef unsigned long	DWORD;

/* These types must be 32-bit integer */
typedef long			LONG;
typedef unsigned long	ULONG;
typedef unsigned long	DWORD;



typedef struct
{
/*         0             1             2             3             4             5             6             7             8             9             10           11             12            13            14            15    */
/*000*/ WORD BIT000:1;  WORD BIT001:1;  WORD BIT002:1;  WORD BIT003:1;  WORD BIT004:1;  WORD BIT005:1;  WORD BIT006:1;  WORD BIT007:1;  WORD BIT008:1;  WORD BIT009:1;  WORD BIT010:1;  WORD BIT011:1;  WORD BIT012:1;  WORD BIT013:1;  WORD BIT014:1;  WORD BIT015:1;
/*001*/ WORD BIT016:1;  WORD BIT017:1;  WORD BIT018:1;  WORD BIT019:1;  WORD BIT020:1;  WORD BIT021:1;  WORD BIT022:1;  WORD BIT023:1;  WORD BIT024:1;  WORD BIT025:1;  WORD BIT026:1;  WORD BIT027:1;  WORD BIT028:1;  WORD BIT029:1;  WORD BIT030:1;  WORD BIT031:1;
/*002*/ WORD BIT032:1;  WORD BIT033:1;  WORD BIT034:1;  WORD BIT035:1;  WORD BIT036:1;  WORD BIT037:1;  WORD BIT038:1;  WORD BIT039:1;  WORD BIT040:1;  WORD BIT041:1;  WORD BIT042:1;  WORD BIT043:1;  WORD BIT044:1;  WORD BIT045:1;  WORD BIT046:1;  WORD BIT047:1;
/*003*/ WORD BIT048:1;  WORD BIT049:1;  WORD BIT050:1;  WORD BIT051:1;  WORD BIT052:1;  WORD BIT053:1;  WORD BIT054:1;  WORD BIT055:1;  WORD BIT056:1;  WORD BIT057:1;  WORD BIT058:1;  WORD BIT059:1;  WORD BIT060:1;  WORD BIT061:1;  WORD BIT062:1;  WORD BIT063:1;
/*004*/ WORD BIT064:1;  WORD BIT065:1;  WORD BIT066:1;  WORD BIT067:1;  WORD BIT068:1;  WORD BIT069:1;  WORD BIT070:1;  WORD BIT071:1;  WORD BIT072:1;  WORD BIT073:1;  WORD BIT074:1;  WORD BIT075:1;  WORD BIT076:1;  WORD BIT077:1;  WORD BIT078:1;  WORD BIT079:1;
/*005*/ WORD BIT080:1;  WORD BIT081:1;  WORD BIT082:1;  WORD BIT083:1;  WORD BIT084:1;  WORD BIT085:1;  WORD BIT086:1;  WORD BIT087:1;  WORD BIT088:1;  WORD BIT089:1;  WORD BIT090:1;  WORD BIT091:1;  WORD BIT092:1;  WORD BIT093:1;  WORD BIT094:1;  WORD BIT095:1;
/*006*/ WORD BIT096:1;  WORD BIT097:1;  WORD BIT098:1;  WORD BIT099:1;  WORD BIT100:1;  WORD BIT101:1;  WORD BIT102:1;  WORD BIT103:1;  WORD BIT104:1;  WORD BIT105:1;  WORD BIT106:1;  WORD BIT107:1;  WORD BIT108:1;  WORD BIT109:1;  WORD BIT110:1;  WORD BIT111:1;
/*007*/ WORD BIT112:1;  WORD BIT113:1;  WORD BIT114:1;  WORD BIT115:1;  WORD BIT116:1;  WORD BIT117:1;  WORD BIT118:1;  WORD BIT119:1;  WORD BIT120:1;  WORD BIT121:1;  WORD BIT122:1;  WORD BIT123:1;  WORD BIT124:1;  WORD BIT125:1;  WORD BIT126:1;  WORD BIT127:1;
/*008*/ WORD BIT128:1;  WORD BIT129:1;  WORD BIT130:1;  WORD BIT131:1;  WORD BIT132:1;  WORD BIT133:1;  WORD BIT134:1;  WORD BIT135:1;  WORD BIT136:1;  WORD BIT137:1;  WORD BIT138:1;  WORD BIT139:1;  WORD BIT140:1;  WORD BIT141:1;  WORD BIT142:1;  WORD BIT143:1;
/*009*/ WORD BIT144:1;  WORD BIT145:1;  WORD BIT146:1;  WORD BIT147:1;  WORD BIT148:1;  WORD BIT149:1;  WORD BIT150:1;  WORD BIT151:1;  WORD BIT152:1;  WORD BIT153:1;  WORD BIT154:1;  WORD BIT155:1;  WORD BIT156:1;  WORD BIT157:1;  WORD BIT158:1;  WORD BIT159:1;
/*010*/ WORD BIT160:1;  WORD BIT161:1;  WORD BIT162:1;  WORD BIT163:1;  WORD BIT164:1;  WORD BIT165:1;  WORD BIT166:1;  WORD BIT167:1;  WORD BIT168:1;  WORD BIT169:1;  WORD BIT170:1;  WORD BIT171:1;  WORD BIT172:1;  WORD BIT173:1;  WORD BIT174:1;  WORD BIT175:1;
/*011*/ WORD BIT176:1;  WORD BIT177:1;  WORD BIT178:1;  WORD BIT179:1;  WORD BIT180:1;  WORD BIT181:1;  WORD BIT182:1;  WORD BIT183:1;  WORD BIT184:1;  WORD BIT185:1;  WORD BIT186:1;  WORD BIT187:1;  WORD BIT188:1;  WORD BIT189:1;  WORD BIT190:1;  WORD BIT191:1;
/*012*/ WORD BIT192:1;  WORD BIT193:1;  WORD BIT194:1;  WORD BIT195:1;  WORD BIT196:1;  WORD BIT197:1;  WORD BIT198:1;  WORD BIT199:1;  WORD BIT200:1;  WORD BIT201:1;  WORD BIT202:1;  WORD BIT203:1;  WORD BIT204:1;  WORD BIT205:1;  WORD BIT206:1;  WORD BIT207:1;
/*013*/ WORD BIT208:1;  WORD BIT209:1;  WORD BIT210:1;  WORD BIT211:1;  WORD BIT212:1;  WORD BIT213:1;  WORD BIT214:1;  WORD BIT215:1;  WORD BIT216:1;  WORD BIT217:1;  WORD BIT218:1;  WORD BIT219:1;  WORD BIT220:1;  WORD BIT221:1;  WORD BIT222:1;  WORD BIT223:1;
/*014*/ WORD BIT224:1;  WORD BIT225:1;  WORD BIT226:1;  WORD BIT227:1;  WORD BIT228:1;  WORD BIT229:1;  WORD BIT230:1;  WORD BIT231:1;  WORD BIT232:1;  WORD BIT233:1;  WORD BIT234:1;  WORD BIT235:1;  WORD BIT236:1;  WORD BIT237:1;  WORD BIT238:1;  WORD BIT239:1;
/*015*/ WORD BIT240:1;  WORD BIT241:1;  WORD BIT242:1;  WORD BIT243:1;  WORD BIT244:1;  WORD BIT245:1;  WORD BIT246:1;  WORD BIT247:1;  WORD BIT248:1;  WORD BIT249:1;  WORD BIT250:1;  WORD BIT251:1;  WORD BIT252:1;  WORD BIT253:1;  WORD BIT254:1;  WORD BIT255:1;
/*016*/ WORD BIT256:1;  WORD BIT257:1;  WORD BIT258:1;  WORD BIT259:1;  WORD BIT260:1;  WORD BIT261:1;  WORD BIT262:1;  WORD BIT263:1;  WORD BIT264:1;  WORD BIT265:1;  WORD BIT266:1;  WORD BIT267:1;  WORD BIT268:1;  WORD BIT269:1;  WORD BIT270:1;  WORD BIT271:1;
/*017*/ WORD BIT272:1;  WORD BIT273:1;  WORD BIT274:1;  WORD BIT275:1;  WORD BIT276:1;  WORD BIT277:1;  WORD BIT278:1;  WORD BIT279:1;  WORD BIT280:1;  WORD BIT281:1;  WORD BIT282:1;  WORD BIT283:1;  WORD BIT284:1;  WORD BIT285:1;  WORD BIT286:1;  WORD BIT287:1;
/*018*/ WORD BIT288:1;  WORD BIT289:1;  WORD BIT290:1;  WORD BIT291:1;  WORD BIT292:1;  WORD BIT293:1;  WORD BIT294:1;  WORD BIT295:1;  WORD BIT296:1;  WORD BIT297:1;  WORD BIT298:1;  WORD BIT299:1;  WORD BIT300:1;  WORD BIT301:1;  WORD BIT302:1;  WORD BIT303:1;
/*019*/ WORD BIT304:1;  WORD BIT305:1;  WORD BIT306:1;  WORD BIT307:1;  WORD BIT308:1;  WORD BIT309:1;  WORD BIT310:1;  WORD BIT311:1;  WORD BIT312:1;  WORD BIT313:1;  WORD BIT314:1;  WORD BIT315:1;  WORD BIT316:1;  WORD BIT317:1;  WORD BIT318:1;  WORD BIT319:1;
/*020*/ WORD BIT320:1;  WORD BIT321:1;  WORD BIT322:1;  WORD BIT323:1;  WORD BIT324:1;  WORD BIT325:1;  WORD BIT326:1;  WORD BIT327:1;  WORD BIT328:1;  WORD BIT329:1;  WORD BIT330:1;  WORD BIT331:1;  WORD BIT332:1;  WORD BIT333:1;  WORD BIT334:1;  WORD BIT335:1;
/*021*/ WORD BIT336:1;  WORD BIT337:1;  WORD BIT338:1;  WORD BIT339:1;  WORD BIT340:1;  WORD BIT341:1;  WORD BIT342:1;  WORD BIT343:1;  WORD BIT344:1;  WORD BIT345:1;  WORD BIT346:1;  WORD BIT347:1;  WORD BIT348:1;  WORD BIT349:1;  WORD BIT350:1;  WORD BIT351:1;
/*022*/ WORD BIT352:1;  WORD BIT353:1;  WORD BIT354:1;  WORD BIT355:1;  WORD BIT356:1;  WORD BIT357:1;  WORD BIT358:1;  WORD BIT359:1;  WORD BIT360:1;  WORD BIT361:1;  WORD BIT362:1;  WORD BIT363:1;  WORD BIT364:1;  WORD BIT365:1;  WORD BIT366:1;  WORD BIT367:1;
/*023*/ WORD BIT368:1;  WORD BIT369:1;  WORD BIT370:1;  WORD BIT371:1;  WORD BIT372:1;  WORD BIT373:1;  WORD BIT374:1;  WORD BIT375:1;  WORD BIT376:1;  WORD BIT377:1;  WORD BIT378:1;  WORD BIT379:1;  WORD BIT380:1;  WORD BIT381:1;  WORD BIT382:1;  WORD BIT383:1;
/*024*/ WORD BIT384:1;  WORD BIT385:1;  WORD BIT386:1;  WORD BIT387:1;  WORD BIT388:1;  WORD BIT389:1;  WORD BIT390:1;  WORD BIT391:1;  WORD BIT392:1;  WORD BIT393:1;  WORD BIT394:1;  WORD BIT395:1;  WORD BIT396:1;  WORD BIT397:1;  WORD BIT398:1;  WORD BIT399:1;
/*025*/ WORD BIT400:1;  WORD BIT401:1;  WORD BIT402:1;  WORD BIT403:1;  WORD BIT404:1;  WORD BIT405:1;  WORD BIT406:1;  WORD BIT407:1;  WORD BIT408:1;  WORD BIT409:1;  WORD BIT410:1;  WORD BIT411:1;  WORD BIT412:1;  WORD BIT413:1;  WORD BIT414:1;  WORD BIT415:1;
/*026*/ WORD BIT416:1;  WORD BIT417:1;  WORD BIT418:1;  WORD BIT419:1;  WORD BIT420:1;  WORD BIT421:1;  WORD BIT422:1;  WORD BIT423:1;  WORD BIT424:1;  WORD BIT425:1;  WORD BIT426:1;  WORD BIT427:1;  WORD BIT428:1;  WORD BIT429:1;  WORD BIT430:1;  WORD BIT431:1;
/*027*/ WORD BIT432:1;  WORD BIT433:1;  WORD BIT434:1;  WORD BIT435:1;  WORD BIT436:1;  WORD BIT437:1;  WORD BIT438:1;  WORD BIT439:1;  WORD BIT440:1;  WORD BIT441:1;  WORD BIT442:1;  WORD BIT443:1;  WORD BIT444:1;  WORD BIT445:1;  WORD BIT446:1;  WORD BIT447:1;
/*028*/ WORD BIT448:1;  WORD BIT449:1;  WORD BIT450:1;  WORD BIT451:1;  WORD BIT452:1;  WORD BIT453:1;  WORD BIT454:1;  WORD BIT455:1;  WORD BIT456:1;  WORD BIT457:1;  WORD BIT458:1;  WORD BIT459:1;  WORD BIT460:1;  WORD BIT461:1;  WORD BIT462:1;  WORD BIT463:1;
/*029*/ WORD BIT464:1;  WORD BIT465:1;  WORD BIT466:1;  WORD BIT467:1;  WORD BIT468:1;  WORD BIT469:1;  WORD BIT470:1;  WORD BIT471:1;  WORD BIT472:1;  WORD BIT473:1;  WORD BIT474:1;  WORD BIT475:1;  WORD BIT476:1;  WORD BIT477:1;  WORD BIT478:1;  WORD BIT479:1;
/*030*/ WORD BIT480:1;  WORD BIT481:1;  WORD BIT482:1;  WORD BIT483:1;  WORD BIT484:1;  WORD BIT485:1;  WORD BIT486:1;  WORD BIT487:1;  WORD BIT488:1;  WORD BIT489:1;  WORD BIT490:1;  WORD BIT491:1;  WORD BIT492:1;  WORD BIT493:1;  WORD BIT494:1;  WORD BIT495:1;
/*031*/ WORD BIT496:1;  WORD BIT497:1;  WORD BIT498:1;  WORD BIT499:1;  WORD BIT500:1;  WORD BIT501:1;  WORD BIT502:1;  WORD BIT503:1;  WORD BIT504:1;  WORD BIT505:1;  WORD BIT506:1;  WORD BIT507:1;  WORD BIT508:1;  WORD BIT509:1;  WORD BIT510:1;  WORD BIT511:1;
/*032*/ WORD BIT512:1;  WORD BIT513:1;  WORD BIT514:1;  WORD BIT515:1;  WORD BIT516:1;  WORD BIT517:1;  WORD BIT518:1;  WORD BIT519:1;  WORD BIT520:1;  WORD BIT521:1;  WORD BIT522:1;  WORD BIT523:1;  WORD BIT524:1;  WORD BIT525:1;  WORD BIT526:1;  WORD BIT527:1;
/*033*/ WORD BIT528:1;  WORD BIT529:1;  WORD BIT530:1;  WORD BIT531:1;  WORD BIT532:1;  WORD BIT533:1;  WORD BIT534:1;  WORD BIT535:1;  WORD BIT536:1;  WORD BIT537:1;  WORD BIT538:1;  WORD BIT539:1;  WORD BIT540:1;  WORD BIT541:1;  WORD BIT542:1;  WORD BIT543:1;
/*034*/ WORD BIT544:1;  WORD BIT545:1;  WORD BIT546:1;  WORD BIT547:1;  WORD BIT548:1;  WORD BIT549:1;  WORD BIT550:1;  WORD BIT551:1;  WORD BIT552:1;  WORD BIT553:1;  WORD BIT554:1;  WORD BIT555:1;  WORD BIT556:1;  WORD BIT557:1;  WORD BIT558:1;  WORD BIT559:1;
/*035*/ WORD BIT560:1;  WORD BIT561:1;  WORD BIT562:1;  WORD BIT563:1;  WORD BIT564:1;  WORD BIT565:1;  WORD BIT566:1;  WORD BIT567:1;  WORD BIT568:1;  WORD BIT569:1;  WORD BIT570:1;  WORD BIT571:1;  WORD BIT572:1;  WORD BIT573:1;  WORD BIT574:1;  WORD BIT575:1;
/*036*/ WORD BIT576:1;  WORD BIT577:1;  WORD BIT578:1;  WORD BIT579:1;  WORD BIT580:1;  WORD BIT581:1;  WORD BIT582:1;  WORD BIT583:1;  WORD BIT584:1;  WORD BIT585:1;  WORD BIT586:1;  WORD BIT587:1;  WORD BIT588:1;  WORD BIT589:1;  WORD BIT590:1;  WORD BIT591:1;
/*037*/ WORD BIT592:1;  WORD BIT593:1;  WORD BIT594:1;  WORD BIT595:1;  WORD BIT596:1;  WORD BIT597:1;  WORD BIT598:1;  WORD BIT599:1;  WORD BIT600:1;  WORD BIT601:1;  WORD BIT602:1;  WORD BIT603:1;  WORD BIT604:1;  WORD BIT605:1;  WORD BIT606:1;  WORD BIT607:1;
/*038*/ WORD BIT608:1;  WORD BIT609:1;  WORD BIT610:1;  WORD BIT611:1;  WORD BIT612:1;  WORD BIT613:1;  WORD BIT614:1;  WORD BIT615:1;  WORD BIT616:1;  WORD BIT617:1;  WORD BIT618:1;  WORD BIT619:1;  WORD BIT620:1;  WORD BIT621:1;  WORD BIT622:1;  WORD BIT623:1;
/*039*/ WORD BIT624:1;  WORD BIT625:1;  WORD BIT626:1;  WORD BIT627:1;  WORD BIT628:1;  WORD BIT629:1;  WORD BIT630:1;  WORD BIT631:1;  WORD BIT632:1;  WORD BIT633:1;  WORD BIT634:1;  WORD BIT635:1;  WORD BIT636:1;  WORD BIT637:1;  WORD BIT638:1;  WORD BIT639:1;
/*040*/ WORD BIT640:1;  WORD BIT641:1;  WORD BIT642:1;  WORD BIT643:1;  WORD BIT644:1;  WORD BIT645:1;  WORD BIT646:1;  WORD BIT647:1;  WORD BIT648:1;  WORD BIT649:1;  WORD BIT650:1;  WORD BIT651:1;  WORD BIT652:1;  WORD BIT653:1;  WORD BIT654:1;  WORD BIT655:1;
/*041*/ WORD BIT656:1;  WORD BIT657:1;  WORD BIT658:1;  WORD BIT659:1;  WORD BIT660:1;  WORD BIT661:1;  WORD BIT662:1;  WORD BIT663:1;  WORD BIT664:1;  WORD BIT665:1;  WORD BIT666:1;  WORD BIT667:1;  WORD BIT668:1;  WORD BIT669:1;  WORD BIT670:1;  WORD BIT671:1;
/*042*/ WORD BIT672:1;  WORD BIT673:1;  WORD BIT674:1;  WORD BIT675:1;  WORD BIT676:1;  WORD BIT677:1;  WORD BIT678:1;  WORD BIT679:1;  WORD BIT680:1;  WORD BIT681:1;  WORD BIT682:1;  WORD BIT683:1;  WORD BIT684:1;  WORD BIT685:1;  WORD BIT686:1;  WORD BIT687:1;
/*043*/ WORD BIT688:1;  WORD BIT689:1;  WORD BIT690:1;  WORD BIT691:1;  WORD BIT692:1;  WORD BIT693:1;  WORD BIT694:1;  WORD BIT695:1;  WORD BIT696:1;  WORD BIT697:1;  WORD BIT698:1;  WORD BIT699:1;  WORD BIT700:1;  WORD BIT701:1;  WORD BIT702:1;  WORD BIT703:1;
/*044*/ WORD BIT704:1;  WORD BIT705:1;  WORD BIT706:1;  WORD BIT707:1;  WORD BIT708:1;  WORD BIT709:1;  WORD BIT710:1;  WORD BIT711:1;  WORD BIT712:1;  WORD BIT713:1;  WORD BIT714:1;  WORD BIT715:1;  WORD BIT716:1;  WORD BIT717:1;  WORD BIT718:1;  WORD BIT719:1;
/*045*/ WORD BIT720:1;  WORD BIT721:1;  WORD BIT722:1;  WORD BIT723:1;  WORD BIT724:1;  WORD BIT725:1;  WORD BIT726:1;  WORD BIT727:1;  WORD BIT728:1;  WORD BIT729:1;  WORD BIT730:1;  WORD BIT731:1;  WORD BIT732:1;  WORD BIT733:1;  WORD BIT734:1;  WORD BIT735:1;
/*046*/ WORD BIT736:1;  WORD BIT737:1;  WORD BIT738:1;  WORD BIT739:1;  WORD BIT740:1;  WORD BIT741:1;  WORD BIT742:1;  WORD BIT743:1;  WORD BIT744:1;  WORD BIT745:1;  WORD BIT746:1;  WORD BIT747:1;  WORD BIT748:1;  WORD BIT749:1;  WORD BIT750:1;  WORD BIT751:1;
/*047*/ WORD BIT752:1;  WORD BIT753:1;  WORD BIT754:1;  WORD BIT755:1;  WORD BIT756:1;  WORD BIT757:1;  WORD BIT758:1;  WORD BIT759:1;  WORD BIT760:1;  WORD BIT761:1;  WORD BIT762:1;  WORD BIT763:1;  WORD BIT764:1;  WORD BIT765:1;  WORD BIT766:1;  WORD BIT767:1;
/*048*/ WORD BIT768:1;  WORD BIT769:1;  WORD BIT770:1;  WORD BIT771:1;  WORD BIT772:1;  WORD BIT773:1;  WORD BIT774:1;  WORD BIT775:1;  WORD BIT776:1;  WORD BIT777:1;  WORD BIT778:1;  WORD BIT779:1;  WORD BIT780:1;  WORD BIT781:1;  WORD BIT782:1;  WORD BIT783:1;
/*049*/ WORD BIT784:1;  WORD BIT785:1;  WORD BIT786:1;  WORD BIT787:1;  WORD BIT788:1;  WORD BIT789:1;  WORD BIT790:1;  WORD BIT791:1;  WORD BIT792:1;  WORD BIT793:1;  WORD BIT794:1;  WORD BIT795:1;  WORD BIT796:1;  WORD BIT797:1;  WORD BIT798:1;  WORD BIT799:1;
/*050*/ WORD BIT800:1;  WORD BIT801:1;  WORD BIT802:1;  WORD BIT803:1;  WORD BIT804:1;  WORD BIT805:1;  WORD BIT806:1;  WORD BIT807:1;  WORD BIT808:1;  WORD BIT809:1;  WORD BIT810:1;  WORD BIT811:1;  WORD BIT812:1;  WORD BIT813:1;  WORD BIT814:1;  WORD BIT815:1;
/*051*/ WORD BIT816:1;  WORD BIT817:1;  WORD BIT818:1;  WORD BIT819:1;  WORD BIT820:1;  WORD BIT821:1;  WORD BIT822:1;  WORD BIT823:1;  WORD BIT824:1;  WORD BIT825:1;  WORD BIT826:1;  WORD BIT827:1;  WORD BIT828:1;  WORD BIT829:1;  WORD BIT830:1;  WORD BIT831:1;
/*052*/ WORD BIT832:1;  WORD BIT833:1;  WORD BIT834:1;  WORD BIT835:1;  WORD BIT836:1;  WORD BIT837:1;  WORD BIT838:1;  WORD BIT839:1;  WORD BIT840:1;  WORD BIT841:1;  WORD BIT842:1;  WORD BIT843:1;  WORD BIT844:1;  WORD BIT845:1;  WORD BIT846:1;  WORD BIT847:1;
/*053*/ WORD BIT848:1;  WORD BIT849:1;  WORD BIT850:1;  WORD BIT851:1;  WORD BIT852:1;  WORD BIT853:1;  WORD BIT854:1;  WORD BIT855:1;  WORD BIT856:1;  WORD BIT857:1;  WORD BIT858:1;  WORD BIT859:1;  WORD BIT860:1;  WORD BIT861:1;  WORD BIT862:1;  WORD BIT863:1;
/*054*/ WORD BIT864:1;  WORD BIT865:1;  WORD BIT866:1;  WORD BIT867:1;  WORD BIT868:1;  WORD BIT869:1;  WORD BIT870:1;  WORD BIT871:1;  WORD BIT872:1;  WORD BIT873:1;  WORD BIT874:1;  WORD BIT875:1;  WORD BIT876:1;  WORD BIT877:1;  WORD BIT878:1;  WORD BIT879:1;
/*055*/ WORD BIT880:1;  WORD BIT881:1;  WORD BIT882:1;  WORD BIT883:1;  WORD BIT884:1;  WORD BIT885:1;  WORD BIT886:1;  WORD BIT887:1;  WORD BIT888:1;  WORD BIT889:1;  WORD BIT890:1;  WORD BIT891:1;  WORD BIT892:1;  WORD BIT893:1;  WORD BIT894:1;  WORD BIT895:1;
/*056*/ WORD BIT896:1;  WORD BIT897:1;  WORD BIT898:1;  WORD BIT899:1;  WORD BIT900:1;  WORD BIT901:1;  WORD BIT902:1;  WORD BIT903:1;  WORD BIT904:1;  WORD BIT905:1;  WORD BIT906:1;  WORD BIT907:1;  WORD BIT908:1;  WORD BIT909:1;  WORD BIT910:1;  WORD BIT911:1;
/*057*/ WORD BIT912:1;  WORD BIT913:1;  WORD BIT914:1;  WORD BIT915:1;  WORD BIT916:1;  WORD BIT917:1;  WORD BIT918:1;  WORD BIT919:1;  WORD BIT920:1;  WORD BIT921:1;  WORD BIT922:1;  WORD BIT923:1;  WORD BIT924:1;  WORD BIT925:1;  WORD BIT926:1;  WORD BIT927:1;
/*058*/ WORD BIT928:1;  WORD BIT929:1;  WORD BIT930:1;  WORD BIT931:1;  WORD BIT932:1;  WORD BIT933:1;  WORD BIT934:1;  WORD BIT935:1;  WORD BIT936:1;  WORD BIT937:1;  WORD BIT938:1;  WORD BIT939:1;  WORD BIT940:1;  WORD BIT941:1;  WORD BIT942:1;  WORD BIT943:1;
/*059*/ WORD BIT944:1;  WORD BIT945:1;  WORD BIT946:1;  WORD BIT947:1;  WORD BIT948:1;  WORD BIT949:1;  WORD BIT950:1;  WORD BIT951:1;  WORD BIT952:1;  WORD BIT953:1;  WORD BIT954:1;  WORD BIT955:1;  WORD BIT956:1;  WORD BIT957:1;  WORD BIT958:1;  WORD BIT959:1;
/*060*/ WORD BIT960:1;  WORD BIT961:1;  WORD BIT962:1;  WORD BIT963:1;  WORD BIT964:1;  WORD BIT965:1;  WORD BIT966:1;  WORD BIT967:1;  WORD BIT968:1;  WORD BIT969:1;  WORD BIT970:1;  WORD BIT971:1;  WORD BIT972:1;  WORD BIT973:1;  WORD BIT974:1;  WORD BIT975:1;
/*061*/ WORD BIT976:1;  WORD BIT977:1;  WORD BIT978:1;  WORD BIT979:1;  WORD BIT980:1;  WORD BIT981:1;  WORD BIT982:1;  WORD BIT983:1;  WORD BIT984:1;  WORD BIT985:1;  WORD BIT986:1;  WORD BIT987:1;  WORD BIT988:1;  WORD BIT989:1;  WORD BIT990:1;  WORD BIT991:1;
/*062*/ WORD BIT992:1;  WORD BIT993:1;  WORD BIT994:1;  WORD BIT995:1;  WORD BIT996:1;  WORD BIT997:1;  WORD BIT998:1;  WORD BIT999:1;  WORD BIT1000:1;  WORD BIT1001:1; WORD BIT1002:1;  WORD BIT1003:1;  WORD BIT1004:1;  WORD BIT1005:1;  WORD BIT1006:1;  WORD BIT1007:1;
/*063*/ WORD BIT1008:1;  WORD BIT1009:1;  WORD BIT1010:1;  WORD BIT1011:1;  WORD BIT1012:1;  WORD BIT1013:1;  WORD BIT1014:1;  WORD BIT1015:1;  WORD BIT1016:1;  WORD BIT1017:1; WORD BIT1018:1;  WORD BIT1019:1;  WORD BIT1020:1;  WORD BIT1021:1;  WORD BIT1022:1;  WORD BIT1023:1;
}Bit;

//typedef struct
//{
///*         0             1             2             3             4             5             6             7             8             9             10           11             12            13            14            15    */
///*000*/ bool B000:1;  bool B001:1;  bool B002:1;  bool B003:1;  bool B004:1;  bool B005:1;  bool B006:1;  bool B007:1;  bool B008:1;  bool B009:1;  bool B010:1;  bool B011:1;  bool B012:1;  bool B013:1;  bool B014:1;  bool B015:1;
///*001*/ bool B016:1;  bool B017:1;  bool B018:1;  bool B019:1;  bool B020:1;  bool B021:1;  bool B022:1;  bool B023:1;  bool B024:1;  bool B025:1;  bool B026:1;  bool B027:1;  bool B028:1;  bool B029:1;  bool B030:1;  bool B031:1;
///*002*/ bool B032:1;  bool B033:1;  bool B034:1;  bool B035:1;  bool B036:1;  bool B037:1;  bool B038:1;  bool B039:1;  bool B040:1;  bool B041:1;  bool B042:1;  bool B043:1;  bool B044:1;  bool B045:1;  bool B046:1;  bool B047:1;
///*003*/ bool B048:1;  bool B049:1;  bool B050:1;  bool B051:1;  bool B052:1;  bool B053:1;  bool B054:1;  bool B055:1;  bool B056:1;  bool B057:1;  bool B058:1;  bool B059:1;  bool B060:1;  bool B061:1;  bool B062:1;  bool B063:1;
///*004*/ bool B064:1;  bool B065:1;  bool B066:1;  bool B067:1;  bool B068:1;  bool B069:1;  bool B070:1;  bool B071:1;  bool B072:1;  bool B073:1;  bool B074:1;  bool B075:1;  bool B076:1;  bool B077:1;  bool B078:1;  bool B079:1;
///*005*/ bool B080:1;  bool B081:1;  bool B082:1;  bool B083:1;  bool B084:1;  bool B085:1;  bool B086:1;  bool B087:1;  bool B088:1;  bool B089:1;  bool B090:1;  bool B091:1;  bool B092:1;  bool B093:1;  bool B094:1;  bool B095:1;
///*006*/ bool B096:1;  bool B097:1;  bool B098:1;  bool B099:1;  bool B100:1;  bool B101:1;  bool B102:1;  bool B103:1;  bool B104:1;  bool B105:1;  bool B106:1;  bool B107:1;  bool B108:1;  bool B109:1;  bool B110:1;  bool B111:1;
///*007*/ bool B112:1;  bool B113:1;  bool B114:1;  bool B115:1;  bool B116:1;  bool B117:1;  bool B118:1;  bool B119:1;  bool B120:1;  bool B121:1;  bool B122:1;  bool B123:1;  bool B124:1;  bool B125:1;  bool B126:1;  bool B127:1;
///*008*/ bool B128:1;  bool B129:1;  bool B130:1;  bool B131:1;  bool B132:1;  bool B133:1;  bool B134:1;  bool B135:1;  bool B136:1;  bool B137:1;  bool B138:1;  bool B139:1;  bool B140:1;  bool B141:1;  bool B142:1;  bool B143:1;
///*009*/ bool B144:1;  bool B145:1;  bool B146:1;  bool B147:1;  bool B148:1;  bool B149:1;  bool B150:1;  bool B151:1;  bool B152:1;  bool B153:1;  bool B154:1;  bool B155:1;  bool B156:1;  bool B157:1;  bool B158:1;  bool B159:1;
///*010*/ bool B160:1;  bool B161:1;  bool B162:1;  bool B163:1;  bool B164:1;  bool B165:1;  bool B166:1;  bool B167:1;  bool B168:1;  bool B169:1;  bool B170:1;  bool B171:1;  bool B172:1;  bool B173:1;  bool B174:1;  bool B175:1;
///*011*/ bool B176:1;  bool B177:1;  bool B178:1;  bool B179:1;  bool B180:1;  bool B181:1;  bool B182:1;  bool B183:1;  bool B184:1;  bool B185:1;  bool B186:1;  bool B187:1;  bool B188:1;  bool B189:1;  bool B190:1;  bool B191:1;
///*012*/ bool B192:1;  bool B193:1;  bool B194:1;  bool B195:1;  bool B196:1;  bool B197:1;  bool B198:1;  bool B199:1;  bool B200:1;  bool B201:1;  bool B202:1;  bool B203:1;  bool B204:1;  bool B205:1;  bool B206:1;  bool B207:1;
///*013*/ bool B208:1;  bool B209:1;  bool B210:1;  bool B211:1;  bool B212:1;  bool B213:1;  bool B214:1;  bool B215:1;  bool B216:1;  bool B217:1;  bool B218:1;  bool B219:1;  bool B220:1;  bool B221:1;  bool B222:1;  bool B223:1;
///*014*/ bool B224:1;  bool B225:1;  bool B226:1;  bool B227:1;  bool B228:1;  bool B229:1;  bool B230:1;  bool B231:1;  bool B232:1;  bool B233:1;  bool B234:1;  bool B235:1;  bool B236:1;  bool B237:1;  bool B238:1;  bool B239:1;
///*015*/ bool B240:1;  bool B241:1;  bool B242:1;  bool B243:1;  bool B244:1;  bool B245:1;  bool B246:1;  bool B247:1;  bool B248:1;  bool B249:1;  bool B250:1;  bool B251:1;  bool B252:1;  bool B253:1;  bool B254:1;  bool B255:1;
///*016*/ bool B256:1;  bool B257:1;  bool B258:1;  bool B259:1;  bool B260:1;  bool B261:1;  bool B262:1;  bool B263:1;  bool B264:1;  bool B265:1;  bool B266:1;  bool B267:1;  bool B268:1;  bool B269:1;  bool B270:1;  bool B271:1;
///*017*/ bool B272:1;  bool B273:1;  bool B274:1;  bool B275:1;  bool B276:1;  bool B277:1;  bool B278:1;  bool B279:1;  bool B280:1;  bool B281:1;  bool B282:1;  bool B283:1;  bool B284:1;  bool B285:1;  bool B286:1;  bool B287:1;
///*018*/ bool B288:1;  bool B289:1;  bool B290:1;  bool B291:1;  bool B292:1;  bool B293:1;  bool B294:1;  bool B295:1;  bool B296:1;  bool B297:1;  bool B298:1;  bool B299:1;  bool B300:1;  bool B301:1;  bool B302:1;  bool B303:1;
///*019*/ bool B304:1;  bool B305:1;  bool B306:1;  bool B307:1;  bool B308:1;  bool B309:1;  bool B310:1;  bool B311:1;  bool B312:1;  bool B313:1;  bool B314:1;  bool B315:1;  bool B316:1;  bool B317:1;  bool B318:1;  bool B319:1;
///*020*/ bool B320:1;  bool B321:1;  bool B322:1;  bool B323:1;  bool B324:1;  bool B325:1;  bool B326:1;  bool B327:1;  bool B328:1;  bool B329:1;  bool B330:1;  bool B331:1;  bool B332:1;  bool B333:1;  bool B334:1;  bool B335:1;
///*021*/ bool B336:1;  bool B337:1;  bool B338:1;  bool B339:1;  bool B340:1;  bool B341:1;  bool B342:1;  bool B343:1;  bool B344:1;  bool B345:1;  bool B346:1;  bool B347:1;  bool B348:1;  bool B349:1;  bool B350:1;  bool B351:1;
///*022*/ bool B352:1;  bool B353:1;  bool B354:1;  bool B355:1;  bool B356:1;  bool B357:1;  bool B358:1;  bool B359:1;  bool B360:1;  bool B361:1;  bool B362:1;  bool B363:1;  bool B364:1;  bool B365:1;  bool B366:1;  bool B367:1;
///*023*/ bool B368:1;  bool B369:1;  bool B370:1;  bool B371:1;  bool B372:1;  bool B373:1;  bool B374:1;  bool B375:1;  bool B376:1;  bool B377:1;  bool B378:1;  bool B379:1;  bool B380:1;  bool B381:1;  bool B382:1;  bool B383:1;
///*024*/ bool B384:1;  bool B385:1;  bool B386:1;  bool B387:1;  bool B388:1;  bool B389:1;  bool B390:1;  bool B391:1;  bool B392:1;  bool B393:1;  bool B394:1;  bool B395:1;  bool B396:1;  bool B397:1;  bool B398:1;  bool B399:1;
///*025*/ bool B400:1;  bool B401:1;  bool B402:1;  bool B403:1;  bool B404:1;  bool B405:1;  bool B406:1;  bool B407:1;  bool B408:1;  bool B409:1;  bool B410:1;  bool B411:1;  bool B412:1;  bool B413:1;  bool B414:1;  bool B415:1;
///*026*/ bool B416:1;  bool B417:1;  bool B418:1;  bool B419:1;  bool B420:1;  bool B421:1;  bool B422:1;  bool B423:1;  bool B424:1;  bool B425:1;  bool B426:1;  bool B427:1;  bool B428:1;  bool B429:1;  bool B430:1;  bool B431:1;
///*027*/ bool B432:1;  bool B433:1;  bool B434:1;  bool B435:1;  bool B436:1;  bool B437:1;  bool B438:1;	bool B439:1;  bool B440:1;  bool B441:1;  bool B442:1;  bool B443:1;  bool B444:1;  bool B445:1;  bool B446:1;  bool B447:1;
///*028*/ bool B448:1;  bool B449:1;  bool B450:1;  bool B451:1;  bool B452:1;  bool B453:1;  bool B454:1;  bool B455:1;  bool B456:1;  bool B457:1;  bool B458:1;  bool B459:1;  bool B460:1;  bool B461:1;  bool B462:1;  bool B463:1;
///*029*/ bool B464:1;  bool B465:1;  bool B466:1;  bool B467:1;  bool B468:1;  bool B469:1;  bool B470:1;  bool B471:1;  bool B472:1;  bool B473:1;  bool B474:1;  bool B475:1;  bool B476:1;  bool B477:1;  bool B478:1;  bool B479:1;
///*030*/ bool B480:1;  bool B481:1;  bool B482:1;  bool B483:1;  bool B484:1;  bool B485:1;  bool B486:1;  bool B487:1;  bool B488:1;  bool B489:1;  bool B490:1;  bool B491:1;  bool B492:1;  bool B493:1;  bool B494:1;  bool B495:1;
///*031*/ bool B496:1;  bool B497:1;  bool B498:1;  bool B499:1;  bool B500:1;  bool B501:1;  bool B502:1;  bool B503:1;  bool B504:1;  bool B505:1;  bool B506:1;  bool B507:1;  bool B508:1;  bool B509:1;  bool B510:1;  bool B511:1;
//}MemoryFlag;




typedef struct{
	uint16_t Preset;
	uint16_t Value;
	bool		 Enable;
	bool     *Output;
	bool			Type;
	bool 			Status;
}Timer_dnp;

/**
 * @brief Boolean Type definition
 */
typedef enum {FALSE = 0, TRUE = !FALSE} Bool;


extern void FILL_EVENTS(void);
extern void PROCESS_CONTROL_RELAY_FUNCTION(void);
extern void FILL_E2PROM_EVENT(void);
extern void PROCEESS_RCV_DATA(void);
extern void CHECK_BUFFER_OVERFLOW(void);
extern void DETECT_EVENT(void);
extern void READ_BUFF(BYTE classtype);

extern void Write_response (void);
extern void Freeze_response (void);
extern void Control_relay (void);
extern void En_dis_event (void);
extern void Make_header (void);
extern void Send_datalink_response (void);
extern void Process_rcv_function (void);
extern void Fill_data (void);
extern void Send_application_response (void);
extern WORD Crc_calc (WORD, WORD);
extern WORD Crc_calc1 (WORD, WORD);
extern void Sub_rcv_Dnp3(BYTE value_udr0,BYTE port);
extern void DNP3_Transmit(WORD datalen);
extern void statrup_dnp3(void);
extern void Dnp3_run(void);
extern void Dnp3_systick(void);
//extern void Read_lookup(void);

//void tcp_Dnp3_send(uint16_t len);

#define Com_Serial 1
#define Ethernet   2




#endif /* DNP3_H_ */
